espressif/esp-idf/components/soc/esp32h4/register/soc/pmu_struct.h
/** Type of dcm_boost_ctrl register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:24;
        /** dcdc_boost_ccm_ctrlen : R/W; bitpos: [24]; default: 0;
         *  need_des
         */
        uint32_t dcdc_boost_ccm_ctrlen:1;
        /** dcdc_boost_ccm_enb : R/W; bitpos: [25]; default: 1;
         *  need_des
         */
        uint32_t dcdc_boost_ccm_enb:1;
        /** dcdc_boost_en : R/W; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t dcdc_boost_en:1;
        /** dcdc_boost_dreg : R/W; bitpos: [31:27]; default: 23;
         *  need_des
         */
        uint32_t dcdc_boost_dreg:5;
    };
    uint32_t val;
} pmu_dcm_boost_ctrl_reg_t;

/** Type of touch_pwr_ctrl register
 *  need_des
 */
typedef union {
    struct {
        /** touch_sleep_cycles : R/W; bitpos: [15:0]; default: 0;
         *  need_des
         */
        uint32_t touch_sleep_cycles:16;
        uint32_t reserved_16:5;
        /** touch_wait_cycles : R/W; bitpos: [29:21]; default: 0;
         *  need_des
         */
        uint32_t touch_wait_cycles:9;
        /** touch_sleep_timer_en : R/W; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t touch_sleep_timer_en:1;
        /** touch_force_done : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t touch_force_done:1;
    };
    uint32_t val;
} pmu_touch_pwr_ctrl_reg_t;

/** Type of date register
 *  need_des
 */
typedef union {
    struct {
        /** pmu_date : R/W; bitpos: [30:0]; default: 37818464;
         *  need_des
         */
        uint32_t pmu_date:31;
        /** clk_en : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t clk_en:1;
    };
    uint32_t val;
} pmu_date_reg_t;


/** Group: status_register */
/** Type of clk_state0 register
 *  need_des
 */
typedef union {
    struct {
        /** stable_xpd_bbpll_state : RO; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t stable_xpd_bbpll_state:1;
        /** stable_xpd_xtal_state : RO; bitpos: [1]; default: 0;
         *  need_des
         */
        uint32_t stable_xpd_xtal_state:1;
        uint32_t reserved_2:13;
        /** sys_clk_slp_sel_state : RO; bitpos: [15]; default: 0;
         *  need_des
         */
        uint32_t sys_clk_slp_sel_state:1;
        /** sys_clk_sel_state : RO; bitpos: [17:16]; default: 0;
         *  need_des
         */
        uint32_t sys_clk_sel_state:2;
        /** sys_clk_no_div_state : RO; bitpos: [18]; default: 0;
         *  need_des
         */
        uint32_t sys_clk_no_div_state:1;
        /** icg_sys_clk_en_state : RO; bitpos: [19]; default: 1;
         *  need_des
         */
        uint32_t icg_sys_clk_en_state:1;
        /** icg_modem_switch_state : RO; bitpos: [20]; default: 0;
         *  need_des
         */
        uint32_t icg_modem_switch_state:1;
        /** icg_modem_code_state : RO; bitpos: [22:21]; default: 0;
         *  need_des
         */
        uint32_t icg_modem_code_state:2;
        /** icg_slp_sel_state : RO; bitpos: [23]; default: 0;
         *  need_des
         */
        uint32_t icg_slp_sel_state:1;
        /** icg_global_xtal_state : RO; bitpos: [24]; default: 0;
         *  need_des
         */
        uint32_t icg_global_xtal_state:1;
        /** icg_global_pll_state : RO; bitpos: [25]; default: 0;
         *  need_des
         */
        uint32_t icg_global_pll_state:1;
        /** ana_i2c_iso_en_state : RO; bitpos: [26]; default: 0;
         *  need_des
         */
        uint32_t ana_i2c_iso_en_state:1;
        /** ana_i2c_retention_state : RO; bitpos: [27]; default: 0;
         *  need_des
         */
        uint32_t ana_i2c_retention_state:1;
        /** ana_xpd_bb_i2c_state : RO; bitpos: [28]; default: 0;
         *  need_des
         */
        uint32_t ana_xpd_bb_i2c_state:1;
        /** ana_xpd_bbpll_i2c_state : RO; bitpos: [29]; default: 0;
         *  need_des
         */
        uint32_t ana_xpd_bbpll_i2c_state:1;
        /** ana_xpd_bbpll_state : RO; bitpos: [30]; default: 0;
         *  need_des
         */
        uint32_t ana_xpd_bbpll_state:1;
        /** ana_xpd_xtal_state : RO; bitpos: [31]; default: 1;
         *  need_des
         */
        uint32_t ana_xpd_xtal_state:1;
    };
    uint32_t val;
} pmu_clk_state0_reg_t;

/** Type of clk_state1 register
 *  need_des
 */
typedef union {
    struct {
        /** icg_func_en_state : RO; bitpos: [31:0]; default: 4294967295;
         *  need_des
         */
        uint32_t icg_func_en_state:32;
    };
    uint32_t val;
} pmu_clk_state1_reg_t;

/** Type of clk_state2 register
 *  need_des
 */
typedef union {
    struct {
        /** icg_apb_en_state : RO; bitpos: [31:0]; default: 4294967295;
         *  need_des
         */
        uint32_t icg_apb_en_state:32;
    };
    uint32_t val;
} pmu_clk_state2_reg_t;

typedef struct pmu_imm_hw_regmap_t
{
    pmu_imm_hp_ck_power_reg_t   hp_ck_power;
    pmu_imm_sleep_sysclk_reg_t  sleep_sysclk;
    pmu_imm_hp_func_icg_reg_t   hp_func_icg;
    pmu_imm_hp_apb_icg_reg_t    hp_apb_icg;
    pmu_imm_modem_icg_reg_t     modem_icg;
    pmu_imm_lp_icg_reg_t        lp_icg;
    pmu_imm_pad_hold_all_reg_t  pad_hold_all;
    pmu_imm_i2c_iso_reg_t       i2c_iso;
} pmu_imm_hw_regmap_t;

typedef struct {
    volatile pmu_hp_active_dig_power_reg_t hp_active_dig_power;
    volatile pmu_hp_active_icg_hp_func_reg_t hp_active_icg_hp_func;
    volatile pmu_hp_active_icg_hp_apb_reg_t hp_active_icg_hp_apb;
    volatile pmu_hp_active_icg_modem_reg_t hp_active_icg_modem;
    volatile pmu_hp_active_hp_sys_cntl_reg_t hp_active_hp_sys_cntl;
    volatile pmu_hp_active_hp_ck_power_reg_t hp_active_hp_ck_power;
    volatile pmu_hp_active_bias_reg_t hp_active_bias;
    volatile pmu_hp_active_backup_reg_t hp_active_backup;
    volatile pmu_hp_active_backup_clk_reg_t hp_active_backup_clk;
    volatile pmu_hp_active_sysclk_reg_t hp_active_sysclk;
    volatile pmu_hp_active_hp_regulator0_reg_t hp_active_hp_regulator0;
    volatile pmu_hp_active_hp_regulator1_reg_t hp_active_hp_regulator1;
    volatile pmu_hp_active_xtal_reg_t hp_active_xtal;
    uint32_t reserved_034[13];
    volatile pmu_hp_sleep_dig_power_reg_t hp_sleep_dig_power;
    volatile pmu_hp_sleep_icg_hp_func_reg_t hp_sleep_icg_hp_func;
    volatile pmu_hp_sleep_icg_hp_apb_reg_t hp_sleep_icg_hp_apb;
    volatile pmu_hp_sleep_icg_modem_reg_t hp_sleep_icg_modem;
    volatile pmu_hp_sleep_hp_sys_cntl_reg_t hp_sleep_hp_sys_cntl;
    volatile pmu_hp_sleep_hp_ck_power_reg_t hp_sleep_hp_ck_power;
    volatile pmu_hp_sleep_bias_reg_t hp_sleep_bias;
    volatile pmu_hp_sleep_backup_reg_t hp_sleep_backup;
    volatile pmu_hp_sleep_backup_clk_reg_t hp_sleep_backup_clk;
    volatile pmu_hp_sleep_sysclk_reg_t hp_sleep_sysclk;
    volatile pmu_hp_sleep_hp_regulator0_reg_t hp_sleep_hp_regulator0;
    volatile pmu_hp_sleep_hp_regulator1_reg_t hp_sleep_hp_regulator1;
    volatile pmu_hp_sleep_xtal_reg_t hp_sleep_xtal;
    volatile pmu_hp_sleep_lp_regulator0_reg_t hp_sleep_lp_regulator0;
    volatile pmu_hp_sleep_lp_regulator1_reg_t hp_sleep_lp_regulator1;
    uint32_t reserved_0a4;
    volatile pmu_hp_sleep_lp_dig_power_reg_t hp_sleep_lp_dig_power;
    volatile pmu_hp_sleep_lp_ck_power_reg_t hp_sleep_lp_ck_power;
    uint32_t reserved_0b0;
    volatile pmu_lp_sleep_lp_regulator0_reg_t lp_sleep_lp_regulator0;
    volatile pmu_lp_sleep_lp_regulator1_reg_t lp_sleep_lp_regulator1;
    volatile pmu_lp_sleep_xtal_reg_t lp_sleep_xtal;
    volatile pmu_lp_sleep_lp_dig_power_reg_t lp_sleep_lp_dig_power;
    volatile pmu_lp_sleep_lp_ck_power_reg_t lp_sleep_lp_ck_power;
    volatile pmu_lp_sleep_bias_reg_t lp_sleep_bias;
    volatile pmu_imm_hw_regmap_t         imm;
    volatile pmu_power_wait_timer0_reg_t power_wait_timer0;
    volatile pmu_power_wait_timer1_reg_t power_wait_timer1;
    volatile pmu_power_wait_timer2_reg_t power_wait_timer2;
    volatile pmu_power_pd_top_cntl_reg_t power_pd_top_cntl;
    volatile pmu_power_pd_hpaon_cntl_reg_t power_pd_hpaon_cntl;
    volatile pmu_power_pd_hpcpu_cntl_reg_t power_pd_hpcpu_cntl;
    volatile pmu_power_pd_hpperi_reserve_reg_t power_pd_hpperi_reserve;
    volatile pmu_power_pd_hpwifi_cntl_reg_t power_pd_hpwifi_cntl;
    volatile pmu_power_pd_lpperi_cntl_reg_t power_pd_lpperi_cntl;
    volatile pmu_power_pd_mem_cntl_reg_t power_pd_mem_cntl;
    volatile pmu_power_pd_mem_mask_reg_t power_pd_mem_mask;
    volatile pmu_power_hp_pad_reg_t power_hp_pad;
    volatile pmu_power_flash1p8_ldo_reg_t power_flash1p8_ldo;
    volatile pmu_power_flash1p2_ldo_reg_t power_flash1p2_ldo;
    volatile pmu_power_vdd_flash_reg_t power_vdd_flash;
    volatile pmu_power_io_ldo_reg_t power_io_ldo;
    volatile pmu_power_vdd_io_reg_t power_vdd_io;
    volatile pmu_power_ck_wait_cntl_reg_t power_ck_wait_cntl;
    volatile pmu_slp_wakeup_cntl0_reg_t slp_wakeup_cntl0;
    volatile pmu_slp_wakeup_cntl1_reg_t slp_wakeup_cntl1;
    volatile pmu_slp_wakeup_cntl2_reg_t slp_wakeup_cntl2;
    volatile pmu_slp_wakeup_cntl3_reg_t slp_wakeup_cntl3;
    volatile pmu_slp_wakeup_cntl4_reg_t slp_wakeup_cntl4;
    volatile pmu_slp_wakeup_cntl5_reg_t slp_wakeup_cntl5;
    volatile pmu_slp_wakeup_cntl6_reg_t slp_wakeup_cntl6;
    volatile pmu_slp_wakeup_cntl7_reg_t slp_wakeup_cntl7;
    volatile pmu_slp_wakeup_status0_reg_t slp_wakeup_status0;
    volatile pmu_slp_wakeup_status1_reg_t slp_wakeup_status1;
    volatile pmu_hp_ck_poweron_reg_t hp_ck_poweron;
    volatile pmu_hp_ck_cntl_reg_t hp_ck_cntl;
    volatile pmu_por_status_reg_t por_status;
    volatile pmu_rf_pwc_reg_t rf_pwc;
    volatile pmu_vddbat_cfg_reg_t vddbat_cfg;
    volatile pmu_backup_cfg_reg_t backup_cfg;
    volatile pmu_int_raw_reg_t int_raw;
    volatile pmu_hp_int_st_reg_t hp_int_st;
    volatile pmu_hp_int_ena_reg_t hp_int_ena;
    volatile pmu_hp_int_clr_reg_t hp_int_clr;
    volatile pmu_lp_int_raw_reg_t lp_int_raw;
    volatile pmu_lp_int_st_reg_t lp_int_st;
    volatile pmu_lp_int_ena_reg_t lp_int_ena;
    volatile pmu_lp_int_clr_reg_t lp_int_clr;
    volatile pmu_lp_cpu_pwr0_reg_t lp_cpu_pwr0;
    volatile pmu_lp_cpu_pwr1_reg_t lp_cpu_pwr1;
    volatile pmu_hp_lp_cpu_comm_reg_t hp_lp_cpu_comm;
    volatile pmu_hp_regulator_cfg_reg_t hp_regulator_cfg;
    volatile pmu_main_state_reg_t main_state;
    volatile pmu_pwr_state_reg_t pwr_state;
    volatile pmu_clk_state0_reg_t clk_state0;
    volatile pmu_clk_state1_reg_t clk_state1;
    volatile pmu_clk_state2_reg_t clk_state2;
    volatile pmu_dcm_ctrl_reg_t dcm_ctrl;
    volatile pmu_dcm_boost_ctrl_reg_t dcm_boost_ctrl;
    volatile pmu_touch_pwr_ctrl_reg_t touch_pwr_ctrl;
    uint32_t reserved_1c4[142];
    volatile pmu_date_reg_t date;
} pmu_dev_t;

extern pmu_dev_t PMU;

#ifndef __cplusplus
_Static_assert(sizeof(pmu_dev_t) == 0x400, "Invalid size of pmu_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
